# ch2_04_list.py

print("리스트: list 란?")
odd = [1, 3, 5, 7, 9]
# 여러 가지 리스트
a = []   # list 초기화
b = [1, 2, 3]
c = ['Life', 'is', 'too', 'short']
d = [1, 2, 'Life', 'is']
e = [1, 2, ['Life', 'is']]

# list 초기화
a = list()
a   # []

print("리스트: 리스트의 인덱싱과 슬라이싱")
a = [1, 2, 3]
a
a[0]
a[3]
a[0]+a[2]
a[-1]
#
a = [1, 2, 3, ['a', 'b', 'c']]
a[0]
a[3]
a[-1]
# chaek this: a[0] + a[-1] -> TypeError
# Indexing inner list
a[-1][0]
a[-1][-1]

# Indexing of triple list
# 삼중 리스트에서 인덱싱하기
a = [1, 2, ['a', 'b', ['Life', 'is']]]
a[2]
a[2][-1]
a[2][-1][0]   # 'Life'
#
# 리스트의 슬라이싱
a = [1, 2, 3, 4, 5]
a[0:2]
a = "12345"
a[0:2]
#
a = [1, 2, 3, 4, 5]
a[0:2]
a[2:]
a[0:4:2]  # a[start:end:step]
#
# 중첩된 리스트에서 슬라이싱하기
#
a = [1, 2, 3, ['a', 'b', 'c'], 4, 5]
a[2:5]
a[3][:2]
#
#
#
# 리스트: 인덱싱, 슬라이싱 연습
#
x = [1, 2, 3, 4, 5, 6, 7, 8, 9]
x[0:3]
x[3:]
x[:6]
x[0:6:2]  # x[:6:2]
x[-1]
x[-3]
x[:-3]
x[::-1]
x[-3::-1]
#
###################################
print("리스트: 리스트 연산하기")
###################################
#
# 리스트 더하기(+)
#
a = [1, 2, 3]
b = [4, 5, 6]
a + b
#
# 리스트 반복하기(*)
#
a * 3
#
# 리스트 길이구하기
#
len(a)
#
# 초보자가 범하기 쉬운 리스트 연산 오류
#
a = [1, 2, 3]
a[2] + "hi"
str(a[2]) + "hi"
#
# 리스트의 수정과 삭제
#
a = [1, 2, 3]
a[2] = 4  # list is mutable!!!
a

#
# del 함수 사용해 리스트 요소 삭제하기
#
a = [1, 2, 3]
del a[1]
a
a = [1, 2, 3, 4, 5]
del a[2:]
a

"""
Author: redwoods
파이썬 코드: ch2_04_list.py
"""
