# wk03_01_list.py

print("리스트: list 란?")
odd = [1, 3, 5, 7, 9]
# 여러 가지 리스트
a = []   # list 초기화
b = [1, 2, 3]
c = ['Life', 'is', 'too', 'short']
d = [1, 2, 'Life', 'is']
e = [1, 2, ['Life', 'is']]

a = list()
a   # []

print("리스트: 리스트의 인덱싱과 슬라이싱")
a = [1, 2, 3]
a
a[0]
a[3]
a[0]+a[2]
a[-1]
#
a = [1, 2, 3, ['a', 'b', 'c']]
a[0]
a[3]
a[-1]
# chaek this: a[0] + a[-1] -> TypeError
# Indexing inner list
a[-1][0]
a[-1][-1]

# Indexing of triple list
# 삼중 리스트에서 인덱싱하기
a = [1, 2, ['a', 'b', ['Life', 'is']]]
a[2]
a[2][-1]
a[2][-1][0]   # 'Life'
#
# 리스트의 슬라이싱
a = [1, 2, 3, 4, 5]
a[0:2]
a = "12345"
a[0:2]
#
a = [1, 2, 3, 4, 5]
a[0:2]
a[2:]
a[0:4:2]  # a[start:end:step]
#
# 중첩된 리스트에서 슬라이싱하기
#
a = [1, 2, 3, ['a', 'b', 'c'], 4, 5]
a[2:5]
a[3][:2]
#
#
#
# 리스트: 인덱싱, 슬라이싱 연습
#
x = [1, 2, 3, 4, 5, 6, 7, 8, 9]
x[0:3]
x[3:]
x[:6]
x[0:6:2]  # x[:6:2]
x[-1]
x[-3]
x[:-3]
x[::-1]
x[-3::-1]
#
#

"""
Author: redwoods
파이썬 코드: wk03_01_list.py
"""