# ch4_02_user_io.py
#
print("사용자 입력과 출력")
#######################################
# 사용자의 입력을 받는 방법과 출력하는 방법
#######################################

print("사용자 입력")
# 사용자가 입력한 값을 어떤 변수에 대입
#######################################
print("input의 사용")
#######################################

a = input()
# Life is too short, you need python
a

print("입력 안내 문구를 이용한 input의 사용")
#######################################
# input("안내 문구")
#######################################

number = input("숫자를 입력하세요: ")

print(number)


print("사용자 출력: print()")
# 입력한 자료형을 출력
#######################################
print("print의 사용")
#######################################

a = 123
print(a)

a = "Python"
print(a)

a = [1, 2, 3]
print(a)

#######################################
print("큰따옴표(\")로 둘러싸인 문자열은 + 연산과 동일")
#
print("life" "is" "too short")
print("life"+"is"+"too short")


#######################################
print("문자열 띄어쓰기는 콤마로 한다")
#
print("life", "is", "too short")


#######################################
print("한 줄에 결괏값 출력하기")
#
for i in range(10):
    print(i, end=' ')




"""
Author: redwoods
파이썬 코드: ch4_02_user_io.py
"""
